УТ_для_edt/src/Catalogs/CRM_НастройкиУправленияКлассификацией/CRM_НастройкиУправленияКлассификацией.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_НастройкиУправленияКлассификацией</name>
  <attributes>
    <name>ИмяСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСпискаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_НастройкиУправленияКлассификацией/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	CRM_КлассификаторыЭкспортныеМетоды.ЗаполнитьИменаСписковУправленияКлассификацией(Элементы.ИмяСписка.СписокВыбора);	
	ДоступПредставление = ПредставлениеНастроекДоступа(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ИмяСпискаПредставление = Элементы.ИмяСписка.СписокВыбора.НайтиПоЗначению(ТекущийОбъект.ИмяСписка).Представление;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьНастройкиКлассификации", Объект.Ссылка, Объект.ИмяСписка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Описание", НСтр("ru='Описание';en='Description'"));
КонецПроцедуры

&НаКлиенте
Процедура ДоступПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокДоступа = Новый СписокЗначений;
	Для каждого СтрокаПользователь Из Объект.Доступ Цикл
		СписокДоступа.Добавить(СтрокаПользователь.Пользователь);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Автор"		   , Объект.Автор);
	ПараметрыФормы.Вставить("СписокДоступа", СписокДоступа);
	
	Оповещение = Новый ОписаниеОповещения("ПослеРедактированияДоступа", ЭтотОбъект);
	ОткрытьФорму("Справочник.CRM_НастройкиУправленияКлассификацией.Форма.НастройкаДоступа", 
		ПараметрыФормы, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияДоступа(Структура, Контекст) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Доступ.Очистить();
	Для Каждого ЭлементСписка Из Структура.СписокДоступа Цикл
		Объект.Доступ.Добавить().Пользователь = ЭлементСписка.Значение;
	КонецЦикла;
	
	ДоступПредставление = ПредставлениеНастроекДоступа(ЭтотОбъект);
	Модифицированность = Истина;

КонецПроцедуры // ПослеРедактированияДоступа()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеНастроекДоступа(Форма)
	
	Результат = "";
	Для Каждого СтрокаТаблицы Из Форма.Объект.Доступ Цикл
		ПредставлениеСтроки = СокрЛП(Строка(СтрокаТаблицы.Пользователь));
		Если ПредставлениеСтроки <> "" Тогда
			Если Результат = "" Тогда
				Результат = Результат + ПредставлениеСтроки;
			Иначе
				Результат = Результат +", "+ ПредставлениеСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = "" Тогда
		Результат = НСтр("ru='Пользователи не выбраны';en='No users selected'");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
